In [1]:
# Import libraries
import pandas as pd
import numpy as np

In [2]:
my_df = pd.read_csv("../data/my-data.csv")

In [3]:
my_df.shape

(2, 4)

In [4]:
my_df.head()

      name   age   weight   height
0  William    29      125      5.2
1  Michael    27      230      5.1

In [5]:
my_df.describe()

             age      weight    height
count   2.000000    2.000000  2.000000
mean   28.000000  177.500000  5.150000
std     1.414214   74.246212  0.070711
min    27.000000  125.000000  5.100000
25%    27.500000  151.250000  5.125000
50%    28.000000  177.500000  5.150000
75%    28.500000  203.750000  5.175000
max    29.000000  230.000000  5.200000